
/*******************************************************************************************
*文件:    sysver.h
*描述:    版本管理
*
*作者:    张冬波
*日期:    2015-01-08
*修改:    创建文件                            ------>     2015-01-08
*         添加时间属性                        ------>     2015-01-15
*
*******************************************************************************************/
#ifndef __SYSVER_H__
#define __SYSVER_H__

#include "datatype.h"

#ifdef __cplusplus
extern "C" {
#endif

#define SYSVER_MODELMAX     40
#define SYSVER_VERSIONMAX   40
#define SYSVER_DATEMAX      40

/*******************************************************************************************
*功能:    版本管理初始化
*参数:
*
*注释:    文件创建
*
*******************************************************************************************/
void sysver_init();

/*******************************************************************************************
*功能:    注册版本信息
*参数:    modelname                     ---->   模块名
*         version                       ---->   版本
*         date                          ---->   build时间
*         返回值                        ---->   true 成功
*
*注释:
*
*******************************************************************************************/
bool sysver_write(const pchar modelname, const pchar version, const pchar date = NULL);

/*******************************************************************************************
*功能:    读取版本信息
*参数:    modelname                     ---->   模块名
*         version                       ---->   版本
*         date                          ---->   build时间
*         fop                           ---->   文件句柄
*         rewind                        ---->   true 从头开始
*         返回值                        ---->   -1 文件结束  0 失败  1成功
*
*注释:
*
*******************************************************************************************/
int32 sysver_read(pchar modelname, pchar version, pchar date = NULL, FILE *fop = NULL, bool rewind = false);

/*******************************************************************************************
*功能:    读取版本信息
*参数:    modelname                     ---->   模块名
*         version                       ---->   版本
*         date                          ---->   build时间
*         返回值                        ---->   true 成功
*
*注释:    由调用者指定模块名
*
*******************************************************************************************/
bool sysver_read2(const pchar modelname, pchar version, pchar date = NULL);

#ifdef __cplusplus
}
#endif

#endif
