/*******************************************************************************************
*文件:    filename.h
*描述:    处理文件名相关，包括路径处理，目录与文件判断，
*           目录文件遍历等
*
*作者:    张冬波
*日期:    2014-11-12
*修改:    创建文件                            ------>     2014-11-12
*         添加特定文件后缀类型                ------>     2015-08-11
*         添加匹配后缀名接口                  ------>     2016-11-24
*
*******************************************************************************************/


#ifndef __FILENAME_H__
#define __FILENAME_H__

//#include <apue.h>
#include "datatype.h"       //标准数据类型定义

#ifdef __cplusplus
extern "C" {
#endif

const static uint16 _FILEPATHMAX = 2048;    //文件路径最大长度
const static uint16 _FILENAMEMAX = 1024;    //文件名最大长度，适应windows的255字符（非字节）限制

//字符操作

/*******************************************************************************************
*功能:    根据当前路径获取目录名和文件名
*参数:    filepath            ---->   文件路径
*         filedir             ---->   目录名
*         filename            ---->   文件名
*
*注释:    存贮空间由调用者维护
*
*******************************************************************************************/
bool split_filepath(const pchar filepath, pchar filedir = NULL, pchar filename = NULL);


/*******************************************************************************************
*功能:    根据目录名和文件名生成当前路径
*参数:    filepath            ---->   文件路径
*         filedir             ---->   目录名
*         filename            ---->   文件名
*
*注释:    存贮空间由调用者维护
*
*******************************************************************************************/
bool make_filepath(const pchar filedir, const pchar filename, pchar filepath);

/*******************************************************************************************
*功能:    判断文件路径是否为文件
*参数:    filepath            ---->   文件路径
*
*注释:    此函数会尝试获取文件属性以确保文件的真实性
*
*******************************************************************************************/
bool is_file(const pchar filepath);


/*******************************************************************************************
*功能:    判断文件路径是否为目录
*参数:    filepath            ---->   文件路径
*
*注释:    此函数会尝试获取目录属性以确保目录的真实性
*
*******************************************************************************************/
bool is_dir(const pchar filepath);

/*******************************************************************************************
*功能:    判断文件是否为系统隐藏文件
*参数:    filepath            ---->   文件路径
*
*注释:    仅试用Linux/Unix
*
*******************************************************************************************/
bool is_hidden(const pchar filepath);

/*******************************************************************************************
*功能:    判断文件路径是否为系统目录
*参数:    filepath            ---->   文件路径
*
*注释:
*******************************************************************************************/
bool is_sysdir(const pchar filepath);


/*******************************************************************************************
*功能:    判断文件名是否合法
*参数:    filename            ---->   文件名
*         b_overwrite         ---->   true修复当前错误
*         rc                  ---->   替换字符，0：表示删除
*
*注释:
*******************************************************************************************/
bool is_filenamevalid(pchar filename, bool b_overwrite = false, char rc = 0);

/*******************************************************************************************
*功能:    判断文件路径是否合法
*参数:    filepath            ---->   文件路径
*         b_overwrite         ---->   true修复当前错误
*         rc                  ---->   文件名替换字符，0：表示删除
*
*注释:
*******************************************************************************************/
bool is_filepathvalid(pchar filepath, bool b_overwrite = false, char rc = 0);

/*******************************************************************************************
*功能:    获取文件扩展名
*参数:    filename            ---->   文件名
*         suffix              ---->   扩展名,以.开头
*         name                ---->   文件名
*         返回值              ---->   后缀名长度
*
*注释:    此函数只分析不带路劲的文件名，
*         无扩展名的文件返回值= 0
*
*******************************************************************************************/
int32 get_filesuffix(const pchar filename, pchar suffix, pchar name = NULL);

/*******************************************************************************************
*功能:    获取文件路径的目录
*参数:    filepath            ---->   文件路径
*           filedir           ---->   目录名
*           index             ---->   目录索引值，0表示根目录
*           nums              ---->   目录总数
*
*注释:    如果是不包含文件的路径，结尾需要"/"
*
*******************************************************************************************/
bool get_filedir(const pchar filepath, int32 index = 0, pchar filedir = NULL, pint32 nums = NULL);

/*******************************************************************************************
*功能:    获取文件路径的根目录
*参数:    filepath            ---->   文件路径
*         root                ---->   根目录名
*         返回值              ---->   子目录起始地址
*
*注释:    返回NULL ， 表示结束
*
*******************************************************************************************/
pchar split_rootdir(const pchar filepath, pchar root);

static const pchar _SYSINNER_TMPFILE = ".SUTMP";
static const pchar _SYSSUFFIXNULL = ".*";
static const pchar _SYSSUFFIXFLAG = "/";


/*******************************************************************************************
*功能:    匹配过滤后缀名
*参数:    filter              ---->   过滤表
*         suffix              ---->   后缀名
*         flag                ---->   分隔符
*         返回值              ---->   true匹配
*
*注释:
*
*******************************************************************************************/
bool filter_filesuffix(const pchar filter, const pchar suffix, const pchar flag = _SYSSUFFIXFLAG);


/*******************************************************************************************
*功能:    获取长文件名的短别名
*参数:    filename            ---->   文件名
*         newname             ---->   后缀名
*         返回值              ---->   别名指针
*
*注释:    如果文件名没有超出范围，则返回值与filename相同
*
*******************************************************************************************/
pchar get_shortname(const pchar filepath, const pchar filename, pchar newname);

#ifdef __cplusplus
}
#endif


#endif


