/*******************************************************************************************
*文件:    date.h
*描述:    计算两个日期之间相差天数
*
*作者:    张昆鹏
*日期:    2016-10-31
*修改:    创建文件                            ------>     2016-11-08
*         修改代码逻辑                        ------>     2016-11-22
*         更改外部调用函数为DaysBetween2Date_ ------>     2017-02-27
*
*******************************************************************************************/

#ifndef DATE_H
#define DATE_H

#include "datatype.h"
#include "debugout.h"

#include <string>
using namespace std;

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************************
*功能:    计算b_date小于e_date的天数
*参数:    b_date                               ---->  日期
*         e_date                               ---->  日期
*         返回值                               ---->  正确相差天数，-1: 错误,-2: b_date大于e_date的天数
*
*注释:   参数b_date要小于e_date,否则统一返回-2，
*******************************************************************************************/
int32 DaysBetween2Date_(string b_date, string e_date);

#ifdef __cplusplus
}
#endif

#endif
