/*******************************************************************************************
*文件:    stringex.h
*描述:    扩展字符串功能
*
*作者:    张冬波
*日期:    2014-12-12
*修改:    创建文件                            ------>     2014-12-12
*         增加sql特殊字符串处理               ------>     2014-12-23
*         增加str2int和strdelspace函数        ------>     2015-01-06
*         增加str2long函数                    ------>     2015-01-14
*         增加printbuf函数                    ------>     2015-01-16
*         修改str2long超出2G限制,str2int的bug
*                                             ------>     2015-01-27
*         增加字符集转换                      ------>     2015-01-30
*         增加字删除首尾特殊字符              ------>     2015-03-09
*         增加strrstr函数                     ------>     2015-05-21
*         增加strstr_nocase函数               ------>     2015-05-28
*         增加mac地址函数                     ------>     2015-11-10
*         增加ip:port地址函数                 ------>     2015-11-23
*         扩展ip地址转换函数                  ------>     2015-11-27
*         重定义strcmp_nocase                 ------>     2015-12-03
*         增加IP地址段相关函数                ------>     2015-12-15
*         扩展ip:port地址函数                 ------>     2015-12-30
*         增加时间处理函数                    ------>     2016-01-20
*         增加UTC时间处理函数                 ------>     2017-05-10
*         增加字符替换处理函数                ------>     2018-01-10
*         添加系统命令调用输出处理函数        ------>     2018-03-29
*         添加IPv6地址支持                    ------>     2018-12-21
*         添加判断字符集接口                  ------>     2020-08-14
*
*******************************************************************************************/
#ifndef __STRINGEX_H__
#define __STRINGEX_H__

#include "datatype.h"
#include <arpa/inet.h>
#include <netinet/in.h>
#include <time.h>

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************************
*功能:    IP 地址转换
*参数:    ip                ---->   地址
*         ipstr             ---->   格式化字符串，可为NULL
*         返回值            ---->   字符串首地址
*
*注释:
*******************************************************************************************/
pchar ip2str(const uint32 ip, const pchar ipstr = NULL);
pchar ipaddr2str(const struct in_addr ip, const pchar ipstr = NULL);

/*******************************************************************************************
*功能:    IP地址转换
*参数:    ip              ---->   地址
*         ipstr           ---->   格式化字符串
*         返回值          ---->   < 0 失败
*
*注释:
*******************************************************************************************/
int32 ipstr2int(const pchar ipstr, puint32 ip);
int32 ipstr2addr(const pchar ipstr, struct in_addr *ip);

/*******************************************************************************************
*功能:    字符串大小写转化
*参数:    str             ---->   源字符串
*         返回值          ---->   首指针
*
*注释:
*******************************************************************************************/

pchar strlower(const pchar str);
pchar strupper(pchar str);

/*******************************************************************************************
*功能:    字符串比较函数
*参数:    src               ---->   源字符串1
*         dst               ---->   源字符串2
*         返回值            ---->   src < dst : -1
*                                   src = dst : 0
*                                   src > dst : 1
*注释:
*******************************************************************************************/

//int32 strcmp_nocase(const pchar src, const pchar dst);
#define strcmp_nocase(s,d) strcasecmp(s,d)

/*******************************************************************************************
*功能:    字符串拷贝
*参数:    src               ---->   源字符串
*         dst               ---->   目的字符串
*         返回值            ---->   新字符串首地址
*
*注释:    支持地址重叠
*
*******************************************************************************************/
pchar strcpy2(pchar dst, pchar src);

/*******************************************************************************************
*功能:    sql语句特殊字符处理
*参数:    src             ---->   源字符串
*         dst             ---->   目的字符串
*         返回值          ---->   新字符串首地址
*
*注释:    用户确保可能插入转义符引起的空间扩大问题
*         dst为NULL，则在源字符串中直接插入
*
*******************************************************************************************/
pchar strsqlcheck(pchar src, pchar dst = NULL);

/*******************************************************************************************
*功能:    字符串转换整数
*参数:    src             ---->   源字符串
*         ival            ---->   转换整数指针
*         返回值          ---->   true 成功
*
*注释:    支持负数
*
*******************************************************************************************/
bool str2int(const pchar src, puint32 ival);
bool str2intex(const pchar src, pint32 ival);
bool str2long(const pchar src, puint64 ival);

/*******************************************************************************************
*功能:    删除首位空白字符
*参数:    src             ---->   源字符串
*         返回值          ---->   ture 发现并处理
*
*注释:    包括\t, \r，\n
*
*******************************************************************************************/
bool strdelspace(pchar src);

/*******************************************************************************************
*功能:    打印缓冲区内容
*参数:    buf             ---->   源数据
*         bufsize         ---->   数据长度
*         返回值          ---->   打印字符地址
*
*注释:    仅支持250个数，格式为16进制
*
*******************************************************************************************/
const pchar printbuf(const void *buf, uint16 bufsize);

/*******************************************************************************************
*功能:    字符集格式转换
*参数:    src_charset     ---->   源字符集
*         src             ---->   源数据
*         dst_charset     ---->   目的字符集
*         dst             ---->   目的数据
*         返回值          ---->   转换后的数据指针，NULL失败
*
*注释:    注意转换可能导致的空间扩充，用户确保安全，目的长度最好为源长度的2倍以上
*         dst为NULL时，内部使用4KB的默认缓冲
*
*         iconv -l 查看支持字符集
*
*******************************************************************************************/
pchar strconv(const char *src_charset, const char *src, const char *dst_charset, char *dst = NULL);

/*******************************************************************************************
*功能:    删除开头和结尾的特殊字符
*参数:    src             ---->   源数据
*参数:    rm              ---->   删除字符集, 可为NULL
*         dst             ---->   目的数据, 可为NULL
*         返回值          ---->   转换后的数据指针
*
*注释:   rm = NULL, 删除空白符
*
*******************************************************************************************/
pchar strstrip_(const pchar src, const pchar rm = NULL, pchar dst = NULL);

#define is_strempty(p) (((p) == NULL) || (*((pchar)(p)) == 0))


/*******************************************************************************************
*功能:    反向查找字符串
*参数:    s1              ---->   源数据
*参数:    s2              ---->   查找字符串
*         返回值          ---->   最后一个字符串指针地址
*
*注释:
*
*******************************************************************************************/
pchar strrstr(const pchar s1, const pchar s2);

/*******************************************************************************************
*功能:    字符串查找
*参数:    s1              ---->   源数据
*参数:    s2              ---->   查找字符串
*         返回值          ---->   第一字符串指针地址，NULL 失败
*
*注释:    不区分大小写
*
*******************************************************************************************/
pchar strstr_nocase(const pchar s1, const pchar s2);


/*******************************************************************************************
*功能:    MAC地址转换
*参数:    mac          ---->   地址
*         macstr       ---->   格式化字符串，可为NULL
*         返回值       ---->   字符串首地址
*
*注释:    little ending
*******************************************************************************************/
pchar mac2str(const uint64 mac, const pchar macstr);


/*******************************************************************************************
*功能:    MAC地址转换
*参数:    mac          ---->   地址
*         macstr       ---->   格式化字符串
*         返回值       ---->   < 0 失败
*
*注释:    必须为xx:xx:xx:xx:xx:xx格式
*******************************************************************************************/
int32 macstr2long(const pchar macstr, puint64 mac);

/*******************************************************************************************
*功能:    ip:port格式字符解析
*参数:    src          ---->   地址串
*         ip           ---->   ip地址
*         port         ---->   端口地址
*         返回值       ---->   true成功
*
*注释:
*******************************************************************************************/
bool str2ipport(const pchar src, uint32 &ip, uint16 &port);

/*******************************************************************************************
*功能:    ip:port格式化
*参数:    ip           ---->   ip地址
*         port         ---->   端口地址
*         strout       ---->   字符串地址，可为NULL
*         返回值       ---->   字符串指针
*
*注释:
*******************************************************************************************/
pchar ipport2str(uint32 ip, uint16 port, pchar strout = NULL);

/*******************************************************************************************
*功能:    ip:port格式字符解析
*参数:    src          ---->   地址串
*         addr         ---->   地址结构
*         返回值       ---->   true成功
*
*注释:
*******************************************************************************************/
bool str2ipport_1(const pchar src, struct sockaddr_in *addr);

/*******************************************************************************************
*功能:    ip:port格式化
*参数:    addr         ---->   地址结构
*         strout       ---->   字符串地址，可为NULL
*         返回值       ---->   字符串指针
*
*注释:
*******************************************************************************************/
pchar ipport2str_1(struct sockaddr_in *addr, pchar strout = NULL);

/*******************************************************************************************
*功能:    ip:port格式字符解析
*参数:    src          ---->   地址串
*         ip           ---->   ip地址
*         port         ---->   端口地址
*         返回值       ---->   true成功
*
*注释:
*******************************************************************************************/
bool str2ipport_2(const pchar src, struct in_addr *ip, uint16 &port);

/*******************************************************************************************
*功能:    ip:port格式化
*参数:    ip           ---->   ip地址
*         port         ---->   端口地址
*         strout       ---->   字符串地址，可为NULL
*         返回值       ---->   字符串指针
*
*注释:
*******************************************************************************************/
pchar ipport2str_2(const struct in_addr *ip, uint16 port, pchar strout = NULL);

/*******************************************************************************************
*功能:    ip:port格式化
*参数:    ip           ---->   ip地址字符串
*         port         ---->   端口地址
*         strout       ---->   字符串地址，可为NULL
*         返回值       ---->   字符串指针
*
*注释:
*******************************************************************************************/
pchar ipport2str_3(const pchar ip, uint16 port, pchar strout = NULL);

//不能为0,网络字节序
typedef struct _iprange {
    uint32 ipl;  //低地址
    uint32 iph;  //高地址
} IPRANGE, *PIPRANGE;
//#define isiprvalid(ipr) (((ipr).ipl != 0) && ((ipr).iph != 0))
#define isiprvalid(ipr) ((ipr).iph != 0)

/*******************************************************************************************
*功能:    获取IP地址范围段，转换为网络字节序
*参数:    ipstr        ---->   ip格式化字符
*         ipr          ---->   ip地址段
*         返回值       ---->   true成功
*
*注释:      支持格式x.x.x.x-x, x.x.x.x-x.x.x.x, x.x.x.x/x
*
*******************************************************************************************/
bool iprset(const pchar ipstr, PIPRANGE ipr);

/*******************************************************************************************
*功能:    判断IP是否在地址段范围内
*参数:    ip           ---->   IP地址
*         ipr          ---->   ip地址段
*         返回值       ---->   true在地址段范围
*
*注释:
*******************************************************************************************/
bool is_inipr(uint32 ip, PIPRANGE ipr);

/*******************************************************************************************
*功能:    比较IP大小(ip1 - ip2)
*参数:    ip1          ---->   IP地址
*         ip2          ---->   IP地址
*         返回值       ---->   <=>
*
*注释:    网络字节序
*
*******************************************************************************************/
int ipcmp(uint32 ip1, uint32 ip2);


/*******************************************************************************************
*功能:    时间转换整数
*参数:    times        ---->   本地时间格式串
*         format       ---->   格式化，默认YYYY-MM-DD HH:MM:SS
*         返回值       ---->   本地时间，-1失败
*
*注释:
*
*******************************************************************************************/
time_t  str2time(const pchar times, const pchar format = NULL);


/*******************************************************************************************
*功能:    时间转换字符串
*参数:    times        ---->   本地时间，-1表示函数自动获取本地时间
*         timebuf      ---->   用户指定输出
*         timesize     ---->   timebuf大小
*         format       ---->   格式化，默认YYYY-MM-DD HH:MM:SS
*         返回值       ---->   字符串指针, NULL失败
*
*注释:
*
*******************************************************************************************/
const pchar time2str(time_t times, pchar timebuf = NULL, int32 timesize = 0, const pchar format = NULL);
const pchar time2str_utc(time_t times, pchar timebuf = NULL, int32 timesize = 0, const pchar format = NULL);

/*******************************************************************************************
*功能:    字符替换函数
*参数:    src          ---->   源地址
*         csrc         ---->   待替换字符
*         cdst         ---->   替换字符
*         dst          ---->   目标地址，可为NULL
*         返回值       ---->   目的地址
*
*注释:
*
*******************************************************************************************/
const pchar strreplace(pchar src, char csrc, char cdst, pchar dst = NULL);


/*******************************************************************************************
*功能:    通过系统命令获取信息
*参数:    cmd          ---->   系统命令
*         out          ---->   输出信息
*         size         ---->   信息长度
*         返回值       ---->   NULL 失败
*
*注释:
*
*******************************************************************************************/
const pchar sysinfo(const pchar cmd, pchar out, int32 size);

/**
 *
 */
#include "platform.h"
#define issyscharset(s) (is_strempty(s) ? true : (strncasecmp(s, SU_SYSCHARSET, strlen(SU_SYSCHARSET)) == 0))
#define is_gbk(s)     (((uint8)(*(s)) >= 0x81) && ((uint8)(*(s)) <= 0xFE) && \
     ((uint8)(*(s+1)) >= 0x40) && ((uint8)(*(s+1)) <= 0xFE))

typedef enum {
    CHARSET_UN = -1,
    CHARSET_ASCII = 0,
    CHARSET_GBK,
    CHARSET_UTF8,
} en_char;

/**
 * [get_sucharset 判断字符集]
 * @Author   张冬波
 * @DateTime 2019-06-20
 * @param    data       [数据]
 * @return              [字符集，默认CHARSET_ASCII]
 */
en_char get_sucharset(pchar data);

#ifdef __cplusplus
}
#endif

#include "ip6str.h"

#endif

